#### Terraform Plan 📋 `prod/argocd`

**Summary:** 18:08:34.955 STDOUT terraform: Plan: 5 to add, 0 to change, 0 to destroy.

<details><summary>Show Plan Details</summary>

```terraform
18:08:34.953 STDOUT terraform:       + force_update               = false
18:08:34.953 STDOUT terraform:       + id                         = (known after apply)
18:08:34.953 STDOUT terraform:       + lint                       = false
18:08:34.953 STDOUT terraform:       + max_history                = 0
18:08:34.953 STDOUT terraform:       + metadata                   = (known after apply)
18:08:34.953 STDOUT terraform:       + name                       = "argocd-apps"
18:08:34.953 STDOUT terraform:       + namespace                  = "argocd"
18:08:34.953 STDOUT terraform:       + pass_credentials           = false
18:08:34.953 STDOUT terraform:       + recreate_pods              = false
18:08:34.953 STDOUT terraform:       + render_subchart_notes      = true
18:08:34.953 STDOUT terraform:       + replace                    = false
18:08:34.953 STDOUT terraform:       + repository                 = "https://argoproj.github.io/argo-helm"
18:08:34.953 STDOUT terraform:       + reset_values               = false
18:08:34.953 STDOUT terraform:       + reuse_values               = false
18:08:34.953 STDOUT terraform:       + set_wo                     = (write-only attribute)
18:08:34.953 STDOUT terraform:       + skip_crds                  = false
18:08:34.953 STDOUT terraform:       + status                     = "deployed"
18:08:34.953 STDOUT terraform:       + take_ownership             = false
18:08:34.953 STDOUT terraform:       + timeout                    = 300
18:08:34.953 STDOUT terraform:       + upgrade_install            = false
18:08:34.953 STDOUT terraform:       + values                     = [
18:08:34.953 STDOUT terraform:           + <<-EOT
18:08:34.954 STDOUT terraform:                 "applications":
18:08:34.954 STDOUT terraform:                 - "destination":
18:08:34.954 STDOUT terraform:                     "namespace": "argocd"
18:08:34.954 STDOUT terraform:                     "server": "https://kubernetes.default.svc"
18:08:34.954 STDOUT terraform:                   "finalizers":
18:08:34.954 STDOUT terraform:                   - "resources-finalizer.argocd.argoproj.io"
18:08:34.954 STDOUT terraform:                   "name": "root-app"
18:08:34.954 STDOUT terraform:                   "project": "default"
18:08:34.954 STDOUT terraform:                   "source":
18:08:34.954 STDOUT terraform:                     "path": "gitops/apps/prod"
18:08:34.954 STDOUT terraform:                     "repoURL": "https://github.com/krukmaksym/my-devops-project-infra"
18:08:34.954 STDOUT terraform:                     "targetRevision": "main"
18:08:34.954 STDOUT terraform:                   "syncPolicy":
18:08:34.954 STDOUT terraform:                     "automated":
18:08:34.954 STDOUT terraform:                       "prune": true
18:08:34.954 STDOUT terraform:                       "selfHeal": true
18:08:34.954 STDOUT terraform:             EOT,
18:08:34.954 STDOUT terraform:         ]
18:08:34.954 STDOUT terraform:       + verify                     = false
18:08:34.954 STDOUT terraform:       + version                    = "2.0.2"
18:08:34.954 STDOUT terraform:       + wait                       = true
18:08:34.954 STDOUT terraform:       + wait_for_jobs              = false
18:08:34.954 STDOUT terraform:     }
18:08:34.954 STDOUT terraform:   # kubernetes_namespace_v1.argocd will be created
18:08:34.954 STDOUT terraform:   + resource "kubernetes_namespace_v1" "argocd" {
18:08:34.954 STDOUT terraform:       + id                               = (known after apply)
18:08:34.954 STDOUT terraform:       + wait_for_default_service_account = false
18:08:34.954 STDOUT terraform:       + metadata {
18:08:34.954 STDOUT terraform:           + generation       = (known after apply)
18:08:34.954 STDOUT terraform:           + labels           = {
18:08:34.954 STDOUT terraform:               + "name" = "argocd"
18:08:34.954 STDOUT terraform:             }
18:08:34.954 STDOUT terraform:           + name             = "argocd"
18:08:34.954 STDOUT terraform:           + resource_version = (known after apply)
18:08:34.954 STDOUT terraform:           + uid              = (known after apply)
18:08:34.954 STDOUT terraform:         }
18:08:34.954 STDOUT terraform:     }
18:08:34.954 STDOUT terraform:   # kubernetes_secret_v1.argocd_redis will be created
18:08:34.954 STDOUT terraform:   + resource "kubernetes_secret_v1" "argocd_redis" {
18:08:34.954 STDOUT terraform:       + binary_data_wo                 = (write-only attribute)
18:08:34.954 STDOUT terraform:       + data                           = (sensitive value)
18:08:34.954 STDOUT terraform:       + data_wo                        = (write-only attribute)
18:08:34.954 STDOUT terraform:       + id                             = (known after apply)
18:08:34.954 STDOUT terraform:       + type                           = "Opaque"
18:08:34.955 STDOUT terraform:       + wait_for_service_account_token = true
18:08:34.955 STDOUT terraform:       + metadata {
18:08:34.955 STDOUT terraform:           + generation       = (known after apply)
18:08:34.955 STDOUT terraform:           + name             = "argocd-redis"
18:08:34.955 STDOUT terraform:           + namespace        = "argocd"
18:08:34.955 STDOUT terraform:           + resource_version = (known after apply)
18:08:34.955 STDOUT terraform:           + uid              = (known after apply)
18:08:34.955 STDOUT terraform:         }
18:08:34.955 STDOUT terraform:     }
18:08:34.955 STDOUT terraform:   # random_password.redis will be created
18:08:34.955 STDOUT terraform:   + resource "random_password" "redis" {
18:08:34.955 STDOUT terraform:       + bcrypt_hash = (sensitive value)
18:08:34.955 STDOUT terraform:       + id          = (known after apply)
18:08:34.955 STDOUT terraform:       + length      = 16
18:08:34.955 STDOUT terraform:       + lower       = true
18:08:34.955 STDOUT terraform:       + min_lower   = 0
18:08:34.955 STDOUT terraform:       + min_numeric = 0
18:08:34.955 STDOUT terraform:       + min_special = 0
18:08:34.955 STDOUT terraform:       + min_upper   = 0
18:08:34.955 STDOUT terraform:       + number      = true
18:08:34.955 STDOUT terraform:       + numeric     = true
18:08:34.955 STDOUT terraform:       + result      = (sensitive value)
18:08:34.955 STDOUT terraform:       + special     = false
18:08:34.955 STDOUT terraform:       + upper       = true
18:08:34.955 STDOUT terraform:     }
18:08:34.955 STDOUT terraform: Plan: 5 to add, 0 to change, 0 to destroy.
18:08:34.955 STDOUT terraform: Changes to Outputs:
18:08:34.955 STDOUT terraform:   + helm_release_name   = "argocd"
18:08:34.955 STDOUT terraform:   + helm_release_status = "deployed"
18:08:34.955 STDOUT terraform:   + namespace           = "argocd"
18:08:35.017 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
18:08:35.017 STDOUT terraform: Saved the plan to: tfplan
18:08:35.018 STDOUT terraform: To perform exactly these actions, run the following command to apply:
18:08:35.018 STDOUT terraform:     terraform apply "tfplan"
```

</details>

*Pusher: @krukmaksym, Action: `pull_request`, Workflow: `Terraform PR Validation`*